# SQL Task (Solved — Intro Level) — Normalising a Flat-File Database (Veterinary Clinic)

> **Teacher reference solution (introductory SQL level)**  
> This version avoids engine-specific clauses (e.g., `ENGINE=...`) and avoids named `CONSTRAINT ...` blocks.  
> It uses only basic **PRIMARY KEY**, **FOREIGN KEY**, and simple table design.

## 0) Setup (JupySQL)

Connect to your database from here using JupySQL.

- **MySQL example:** `mysql+pymysql://USER:PASSWORD@HOST:PORT/DBNAME`  
- **PostgreSQL example:** `postgresql://USER:PASSWORD@HOST:PORT/DBNAME`

In [1]:
# %load_ext sql
# %sql mysql+pymysql://USER:PASSWORD@HOST:PORT/DBNAME
# %%sql
# SELECT 1;

In [2]:
# Inicialize the SQL extension
%load_ext sql

In [3]:
# Connect to the MySQL database
%sql mysql+pymysql://mysql_user:mysql_password@localhost:3306/mydatabase

%config SqlMagic.displaylimit = 0

Connecting to 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

In [4]:
%%sql
-- Teste connection: Should return 1 if successful
SELECT 1;

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

1 rows affected.

+---+
| 1 |
+---+
| 1 |
+---+

---

## 1) Starting point: the flat table (given)

Dates are stored in SQL as ISO `YYYY-MM-DD`. (See more about [ISO 8601](https://www.iso.org/iso-8601-date-and-time-format.html) and the [MySQL reference](https://dev.mysql.com/doc/refman/8.4/en/date-and-time-literals.html))

### 1.1 Create and populate the flat table

Run (or adapt) the SQL below to create `vet_flat` and insert the sample data.

In [5]:
%%sql
DROP TABLE IF EXISTS vet_flat;

CREATE TABLE vet_flat (
  owner_id        INT,
  owner_name      VARCHAR(100),
  owner_address   VARCHAR(200),
  patient_id      INT,
  patient_name    VARCHAR(100),
  patient_type    VARCHAR(50),
  vet_id          INT,
  vet_name        VARCHAR(100),
  vet_address     VARCHAR(200),
  visit_date      DATE,
  treatment       VARCHAR(100),
  treatment_type  VARCHAR(50),
  cost            DECIMAL(10,2)
);

INSERT INTO vet_flat VALUES
(1029, 'Alison Bachman', '12 Green Lane, 20192', 1011, 'Oskar',  'Dog',     4400, 'Rachel', '345 Ridley St, 99554',  '2025-05-23', 'Worming',      'Tablet',     50),
(1922, 'Aria Mathers',   '458 Rigistr, 4993',    1012, 'Seb',    'Cat',     4100, 'Lucy',   '29 Entle Street, 3049', '2025-05-23', 'Broken Tail',  'Surgery',    400),
(1029, 'Alison Bachman', '12 Green Lane, 20192', 3999, 'Jaques', 'Hamster', 4400, 'Rachel', '345 Ridley St, 99554',  '2025-05-23', 'Cut of Paw',   'Medication', 50),
(2032, 'Theo Naidoo',    '45 Rue Martignac',     2393, 'Kai',    'Dog',     4400, 'Rachel', '345 Ridley St, 99554',  '2025-05-23', 'Broken Leg',   'Surgery',    450),
(2032, 'Theo Naidoo',    '45 Rue Martignac',     2393, 'Kai',    'Dog',     4400, 'Rachel', '345 Ridley St, 99554',  '2025-08-17', 'Cast Removal', 'Surgery',    200);

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

5 rows affected.

++
||
++
++

### 1.2 Explore the data (3–5 queries)

Write **3–5 simple queries** to explore the data and spot repetition patterns (e.g., the same owner appears across multiple rows).

In [9]:
%%sql
-- Query #1
DESCRIBE vet_flat;

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

13 rows affected.

+----------------+---------------+------+-----+---------+-------+
|     Field      |      Type     | Null | Key | Default | Extra |
+----------------+---------------+------+-----+---------+-------+
|    owner_id    |      int      | YES  |     |   None  |       |
|   owner_name   |  varchar(100) | YES  |     |   None  |       |
| owner_address  |  varchar(200) | YES  |     |   None  |       |
|   patient_id   |      int      | YES  |     |   None  |       |
|  patient_name  |  varchar(100) | YES  |     |   None  |       |
|  patient_type  |  varchar(50)  | YES  |     |   None  |       |
|     vet_id     |      int      | YES  |     |   None  |       |
|    vet_name    |  varchar(100) | YES  |     |   None  |       |
|  vet_address   |  varchar(200) | YES  |     |   None  |       |
|   visit_date   |      date     | YES  |     |   None  |       |
|   treatment    |  varchar(100) | YES  |     |   None  |       |
| treatment_type |  varchar(50)  | YES  |     |   None  |       |
|      cost      | decimal(10,2) | YES  |     |   None  |       |
+----------------+---------------+------+-----+---------+-------+

In [10]:
%%sql
-- Query #2
SELECT * FROM vet_flat;

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

5 rows affected.

+----------+----------------+----------------------+------------+--------------+--------------+--------+----------+-----------------------+------------+--------------+----------------+--------+
| owner_id |   owner_name   |    owner_address     | patient_id | patient_name | patient_type | vet_id | vet_name |      vet_address      | visit_date |  treatment   | treatment_type |  cost  |
+----------+----------------+----------------------+------------+--------------+--------------+--------+----------+-----------------------+------------+--------------+----------------+--------+
|   1029   | Alison Bachman | 12 Green Lane, 20192 |    1011    |    Oskar     |     Dog      |  4400  |  Rachel  |  345 Ridley St, 99554 | 2025-05-23 |   Worming    |     Tablet     | 50.00  |
|   1922   |  Aria Mathers  |  458 Rigistr, 4993   |    1012    |     Seb      |     Cat      |  4100  |   Lucy   | 29 Entle Street, 3049 | 2025-05-23 | Broken Tail  |    Surgery     | 400.00 |
|   1029   | Alison Bachman | 12 Green Lane, 20192 |    3999    |    Jaques    |   Hamster    |  4400  |  Rachel  |  345 Ridley St, 99554 | 2025-05-23 |  Cut of Paw  |   Medication   | 50.00  |
|   2032   |  Theo Naidoo   |   45 Rue Martignac   |    2393    |     Kai      |     Dog      |  4400  |  Rachel  |  345 Ridley St, 99554 | 2025-05-23 |  Broken Leg  |    Surgery     | 450.00 |
|   2032   |  Theo Naidoo   |   45 Rue Martignac   |    2393    |     Kai      |     Dog      |  4400  |  Rachel  |  345 Ridley St, 99554 | 2025-08-17 | Cast Removal |    Surgery     | 200.00 |
+----------+----------------+----------------------+------------+--------------+--------------+--------+----------+-----------------------+------------+--------------+----------------+--------+

In [11]:
%%sql
-- Query #3
-- How many rows per owner? (spot repeated owner data)
SELECT owner_id, owner_name, COUNT(*) AS num_rows
FROM vet_flat
GROUP BY owner_id, owner_name
ORDER BY num_rows DESC;

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

3 rows affected.

+----------+----------------+----------+
| owner_id |   owner_name   | num_rows |
+----------+----------------+----------+
|   1029   | Alison Bachman |    2     |
|   2032   |  Theo Naidoo   |    2     |
|   1922   |  Aria Mathers  |    1     |
+----------+----------------+----------+

In [12]:
%%sql
-- Query #4
-- How many rows per vet? (spot repeated vet data)
SELECT vet_id, vet_name, COUNT(*) AS num_rows
FROM vet_flat
GROUP BY vet_id, vet_name
ORDER BY num_rows DESC;

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

2 rows affected.

+--------+----------+----------+
| vet_id | vet_name | num_rows |
+--------+----------+----------+
|  4400  |  Rachel  |    4     |
|  4100  |   Lucy   |    1     |
+--------+----------+----------+

In [13]:
%%sql
-- Query #5
-- Which patients appear more than once? (repeated patient across visits)
SELECT patient_id, patient_name, COUNT(*) AS num_rows
FROM vet_flat
GROUP BY patient_id, patient_name
HAVING COUNT(*) > 1;

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

1 rows affected.

+------------+--------------+----------+
| patient_id | patient_name | num_rows |
+------------+--------------+----------+
|    2393    |     Kai      |    2     |
+------------+--------------+----------+

## 2) Diagnose the problems (answers)

**Redundancy:**

- Owner data repeats across multiple rows (same `OwnerID` appears with the same `OwnerName` and `OwnerAddress`).
- Vet data repeats across multiple rows (same `VetID` appears with the same `VetName` and `VetAddress`).
- Patient data repeats whenever the same patient has more than one visit (e.g., the same `PatientID` appears multiple times with the same `PatientName` and `PatientType`).
- Treatment information can repeat across visits (same `Treatment` and `Treatment Type` appear in multiple rows).

**Anomalies:**

- **Update anomaly:** If a vet’s (or owner’s) address changes, it must be updated in every row where that vet (or owner) appears. Missing one row creates inconsistent data.
- **Insertion anomaly:** You cannot add a new owner/patient/vet unless you also create a visit row to store their details.
- **Deletion anomaly:** If you delete the last visit row for an owner/patient/vet, you may accidentally delete the only stored information about that owner/patient/vet.

**Functional dependencies:**

- `OwnerID → OwnerName, OwnerAddress`
- `VetID → VetName, VetAddress`
- `PatientID → PatientName, PatientType, OwnerID`
- `(PatientID, VetID, Date) → Treatment, TreatmentType, Cost`

## 3) Normalisation (1NF → 2NF → 3NF)

Normalise the database to at least **3NF**, showing and justifying your steps.

### Required functional expectations
- One **owner** can have **many patients**
- One **patient** can have **many visits**
- Each **visit** is handled by **one vet**
- A **visit may include one or more treatments**  
  *(Even if the flat file shows only one treatment per row, your new model must support multiple treatments per visit.)*

---

### 3.1 First Normal Form (1NF)
Explain how 1NF applies here (atomic values, no repeating groups).

### 3.2 Second Normal Form (2NF)
Explain how your design avoids partial dependencies.

### 3.3 Third Normal Form (3NF)
Explain how your design removes transitive dependencies.

### Your normalisation notes

- **1NF:** The flat table uses atomic values (one value per field) and has no repeating groups, so it can be considered in 1NF. However, it still mixes multiple entities (owner, patient, vet, visit, treatment) in a single table, causing repeated data.
- **2NF:** To remove partial dependencies, we separate attributes that depend only on part of the (implicit) visit information. Owner details depend on `OwnerID`, vet details depend on `VetID`, and patient details depend on `PatientID`, so these are moved into separate tables.
- **3NF:** To remove transitive dependencies, we keep owner/vet/patient attributes only in their own tables and model each visit as its own record. Treatment information is stored once in a treatments table, and costs are stored in the link between a visit and a treatment (so a visit can have multiple treatments).

**Final tables (3NF) with PK/FK (list):**

- `owners(owner_id PK, owner_name, owner_address)`
- `patients(patient_id PK, owner_id FK → owners.owner_id, patient_name, patient_type)`
- `vets(vet_id PK, vet_name, vet_address)`
- `visits(visit_id PK, patient_id FK → patients.patient_id, vet_id FK → vets.vet_id, visit_date)`
- `treatments(treatment_id PK, treatment_name, treatment_type)`
- `visit_treatments(visit_id PK/FK → visits.visit_id, treatment_id PK/FK → treatments.treatment_id, cost)`

## 4) ERD (Entity–Relationship Diagram)

Create an ERD showing:
- entities (tables) and key attributes  
- **PK/FK clearly labelled**  
- cardinalities (1–N, N–N)  
- associative table(s) where needed (e.g., visit–treatment)

### Add your ERD here
1. Export your ERD as an image (PNG recommended).
2. Place it next to this notebook (same folder) as `erd.png`.
3. Embed it below by keeping the Markdown image link.

![ERD](erd.png)

## 4) ERD (text)

```mermaid
erDiagram
  OWNERS     ||--o{ PATIENTS : owns
  PATIENTS   ||--o{ VISITS : has
  VETS       ||--o{ VISITS : attends
  VISITS     ||--o{ VISIT_TREATMENTS : includes
  TREATMENTS ||--o{ VISIT_TREATMENTS : recorded_in
```

## 5) Create the normalised tables (basic SQL)

In [14]:
%%sql
DROP TABLE IF EXISTS visit_treatments;
DROP TABLE IF EXISTS visits;
DROP TABLE IF EXISTS treatments;
DROP TABLE IF EXISTS patients;
DROP TABLE IF EXISTS vets;
DROP TABLE IF EXISTS owners;

CREATE TABLE owners (
  owner_id      INT PRIMARY KEY,
  owner_name    VARCHAR(100) NOT NULL,
  owner_address VARCHAR(200) NOT NULL
);

CREATE TABLE patients (
  patient_id   INT PRIMARY KEY,
  owner_id     INT NOT NULL,
  patient_name VARCHAR(100) NOT NULL,
  patient_type VARCHAR(50) NOT NULL,
  FOREIGN KEY (owner_id) REFERENCES owners(owner_id)
);

CREATE TABLE vets (
  vet_id      INT PRIMARY KEY,
  vet_name    VARCHAR(100) NOT NULL,
  vet_address VARCHAR(200) NOT NULL
);

CREATE TABLE visits (
  visit_id   INT PRIMARY KEY,
  patient_id INT NOT NULL,
  vet_id     INT NOT NULL,
  visit_date DATE NOT NULL,
  FOREIGN KEY (patient_id) REFERENCES patients(patient_id),
  FOREIGN KEY (vet_id) REFERENCES vets(vet_id)
);

CREATE TABLE treatments (
  treatment_id   INT PRIMARY KEY,
  treatment_name VARCHAR(100) NOT NULL,
  treatment_type VARCHAR(50)  NOT NULL,
  UNIQUE (treatment_name)
);

CREATE TABLE visit_treatments (
  visit_id     INT NOT NULL,
  treatment_id INT NOT NULL,
  cost         DECIMAL(10,2) NOT NULL,
  PRIMARY KEY (visit_id, treatment_id),
  FOREIGN KEY (visit_id) REFERENCES visits(visit_id),
  FOREIGN KEY (treatment_id) REFERENCES treatments(treatment_id)
);

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

++
||
++
++

## 6) Insert data (simple inserts)

Explicit IDs (intro level). Includes one visit with **two** treatments.

In [15]:
%%sql
INSERT INTO owners VALUES
    (1029, 'Alison Bachman', '12 Green Lane, 20192'),
    (1922, 'Aria Mathers',   '458 Rigistr, 4993'),
    (2032, 'Theo Naidoo',    '45 Rue Martignac');

INSERT INTO patients VALUES
    (1011, 1029, 'Oskar',  'Dog'),
    (1012, 1922, 'Seb',    'Cat'),
    (3999, 1029, 'Jaques', 'Hamster'),
    (2393, 2032, 'Kai',    'Dog');

INSERT INTO vets VALUES
    (4400, 'Rachel', '345 Ridley St, 99554'),
    (4100, 'Lucy',   '29 Entle Street, 3049');

INSERT INTO treatments VALUES
    (1, 'Worming',      'Tablet'),
    (2, 'Broken Tail',  'Surgery'),
    (3, 'Cut of Paw',   'Medication'),
    (4, 'Broken Leg',   'Surgery'),
    (5, 'Cast Removal', 'Surgery'),
    (6, 'Pain Relief',  'Medication');

INSERT INTO visits VALUES
    (1, 1011, 4400, '2025-05-23'),
    (2, 1012, 4100, '2025-05-23'),
    (3, 3999, 4400, '2025-05-23'),
    (4, 2393, 4400, '2025-05-23'),
    (5, 2393, 4400, '2025-08-17');

INSERT INTO visit_treatments VALUES
    (1, 1,  50),
    (2, 2, 400),
    (3, 3,  50),
    (4, 4, 450),
    (5, 5, 200),
    (4, 6,  30);

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

3 rows affected.

4 rows affected.

2 rows affected.

6 rows affected.

5 rows affected.

6 rows affected.

++
||
++
++

## 7) Validation queries (6 examples)

In [16]:
%%sql
-- (1) All visits for a specific owner (owner_id = 1029)
SELECT o.owner_id, o.owner_name,
       p.patient_name,
       v.visit_date,
       ve.vet_name,
       t.treatment_name,
       vt.cost
FROM owners o
JOIN patients p ON p.owner_id = o.owner_id
JOIN visits v ON v.patient_id = p.patient_id
JOIN vets ve ON ve.vet_id = v.vet_id
JOIN visit_treatments vt ON vt.visit_id = v.visit_id
JOIN treatments t ON t.treatment_id = vt.treatment_id
WHERE o.owner_id = 1029
ORDER BY v.visit_date, p.patient_name, t.treatment_name;

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

2 rows affected.

+----------+----------------+--------------+------------+----------+----------------+-------+
| owner_id |   owner_name   | patient_name | visit_date | vet_name | treatment_name |  cost |
+----------+----------------+--------------+------------+----------+----------------+-------+
|   1029   | Alison Bachman |    Jaques    | 2025-05-23 |  Rachel  |   Cut of Paw   | 50.00 |
|   1029   | Alison Bachman |    Oskar     | 2025-05-23 |  Rachel  |    Worming     | 50.00 |
+----------+----------------+--------------+------------+----------+----------------+-------+

In [17]:
%%sql
-- (2) Patient history (patient_id = 2393)
SELECT p.patient_id, p.patient_name,
       v.visit_date,
       ve.vet_name,
       t.treatment_name,
       vt.cost
FROM patients p
JOIN visits v ON v.patient_id = p.patient_id
JOIN vets ve ON ve.vet_id = v.vet_id
JOIN visit_treatments vt ON vt.visit_id = v.visit_id
JOIN treatments t ON t.treatment_id = vt.treatment_id
WHERE p.patient_id = 2393
ORDER BY v.visit_date, t.treatment_name;

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

3 rows affected.

+------------+--------------+------------+----------+----------------+--------+
| patient_id | patient_name | visit_date | vet_name | treatment_name |  cost  |
+------------+--------------+------------+----------+----------------+--------+
|    2393    |     Kai      | 2025-05-23 |  Rachel  |   Broken Leg   | 450.00 |
|    2393    |     Kai      | 2025-05-23 |  Rachel  |  Pain Relief   | 30.00  |
|    2393    |     Kai      | 2025-08-17 |  Rachel  |  Cast Removal  | 200.00 |
+------------+--------------+------------+----------+----------------+--------+

In [18]:
%%sql
-- (3) Total spend per owner
SELECT o.owner_id, o.owner_name, SUM(vt.cost) AS total_spent
FROM owners o
JOIN patients p ON p.owner_id = o.owner_id
JOIN visits v ON v.patient_id = p.patient_id
JOIN visit_treatments vt ON vt.visit_id = v.visit_id
GROUP BY o.owner_id, o.owner_name
ORDER BY total_spent DESC;

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

3 rows affected.

+----------+----------------+-------------+
| owner_id |   owner_name   | total_spent |
+----------+----------------+-------------+
|   2032   |  Theo Naidoo   |    680.00   |
|   1922   |  Aria Mathers  |    400.00   |
|   1029   | Alison Bachman |    100.00   |
+----------+----------------+-------------+

In [19]:
%%sql
-- (4) Visits per vet in a date range
SELECT ve.vet_id, ve.vet_name, COUNT(*) AS num_visits
FROM vets ve
JOIN visits v ON v.vet_id = ve.vet_id
WHERE v.visit_date BETWEEN '2025-05-01' AND '2025-06-01'
GROUP BY ve.vet_id, ve.vet_name
ORDER BY num_visits DESC;

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

2 rows affected.

+--------+----------+------------+
| vet_id | vet_name | num_visits |
+--------+----------+------------+
|  4400  |  Rachel  |     3      |
|  4100  |   Lucy   |     1      |
+--------+----------+------------+

In [20]:
%%sql
-- (5) Top 3 treatments
SELECT t.treatment_name, COUNT(*) AS times_given
FROM visit_treatments vt
JOIN treatments t ON t.treatment_id = vt.treatment_id
GROUP BY t.treatment_name
ORDER BY times_given DESC
LIMIT 3;

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

3 rows affected.

+----------------+-------------+
| treatment_name | times_given |
+----------------+-------------+
|    Worming     |      1      |
|  Broken Tail   |      1      |
|   Cut of Paw   |      1      |
+----------------+-------------+

In [21]:
%%sql
-- (6) Patients by species and owners
SELECT p.patient_type, p.patient_name, o.owner_name
FROM patients p
JOIN owners o ON o.owner_id = p.owner_id
ORDER BY p.patient_type, p.patient_name;

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

4 rows affected.

+--------------+--------------+----------------+
| patient_type | patient_name |   owner_name   |
+--------------+--------------+----------------+
|     Cat      |     Seb      |  Aria Mathers  |
|     Dog      |     Kai      |  Theo Naidoo   |
|     Dog      |    Oskar     | Alison Bachman |
|   Hamster    |    Jaques    | Alison Bachman |
+--------------+--------------+----------------+

## 8) Justification (short, intro level)

- The flat table repeats owner/vet/patient data (redundancy).
- The normalised tables store each type of data once.
- Foreign keys link the tables and keep the data consistent.
- `visit_treatments` allows more than one treatment per visit.

---
**end of doc**